{"text": "Say we're able to get to that space, right? Like the move, like the movement that happens with AI and with just technology, which will advance quicker, I think, which is one thing that AI feels like to me it's a fast forward button on technology and on possibility. Because things can be, information can be quantified so quick and a lot of like more menial tasks, even though they're not really menial in people's lives, but menial hypothetically can be done quicker to get a lot of the framework for things done fast. But how will people survive? Like how do we adjust our structure of finance of like if some people own the companies that have the AI and then a lot of people are just using the AIs and the agents created by AIs to do things for them, how will society, like societal members still be able to financially survive? Will there still be money? What is that? Does that make any sense? That question totally makes sense. Okay, sorry, I don't know, neither does anybody else. But I'll tell you my current best guess. Okay, well, I'll say two guesses. One, I think it is possible that we put, you know, GPT 7 or whatever in everybody's chatgpt. Everybody gets it for free and everybody has access to just this like crazy thing such that everybody can be more productive, make way more money. It doesn't actually matter that you don't like own the cluster itself, but everybody gets to use it. And it turns out even getting to use it is enough that people are like getting richer, faster and more distributed than ever before that could happen. I think that really is possible. There's another version of this where the most important things that are happening are these systems are discovering new cures for diseases, new kinds of energy, new ways to make spaceships, whatever, and most of that value is accruing to the cluster owners, us. Just so that I'm not dodging the question here. And then I think society will very quickly say, okay, we gotta have some new, some new economic model where we share that and distribute that to people. I used to be really excited about things like ubi. I still am kind of excited. Like Universal Basic Income where you just give everybody money. Yeah, you hear that term a lot. Yeah, Universal basic Income income. Yeah, I heard you and Rogan talk about that too back. I still am kind of excited about that. But I think people really need agency. Like they really need to feel like they have a voice in governing the future and deciding where things go. And I think if you just like say, okay, AI is going to do everything and then everybody gets like a dividend from that. It's not going to feel good. And I don't think it actually would be good for people. So I think we need to find a way where we're not just like if we're in this world where we're not just distributing money or wealth. I don't just want a check every month. What I would want is ownership share in whatever the AI creates so that I feel like I'm participating in this thing that's going to compound and get more valuable over time. So I sort of like universal basic wealth better than universal basic income. And I think I don't like basic either. I want like universal extreme wealth for everybody. But even then I think what people really want is the agency to kind of co create the future together. And in a world where it's like the AI is mostly coming up with the new scientific inventions and at least we've got to still have humans like invent the new culture and have that be a very distributed thing. Okay, I guess, yeah, I see what you're saying. But would that be like an American thing, do you think, like since they were invented here, or do you think. I'm just wondering, what does that look like? You know, the economic model of it all or the whole thing? Yeah. Or like is there a dividend of the company that sin is divided up between the masses? Sort of. I mean, a crazy idea, but in the spirit of crazy ideas, is that if the world, there's like 8, roughly 8 billion people in the world. If the world can generate like 8 quintillion tokens per year, if that's the world. Actually, let's say the world can generate 20 trillion quint. 20 quintillion tokens per year. Tokens of like each word generated by an AI. Okay, just making up a huge number here. Okay, will say, okay, 12 of those go to the normal capitalistic system, but eight of those eight quintillion tokens are going to get divided up equally among 8 billion people. So everybody gets 1 trillion tokens. And that's your kind of universal basic wealth globally. And people can sell those tokens. Like if I don't need mine, I can sell them to you. We could pool ours together for some new art project we want to do. But instead of just getting a token check, everybody on Earth is getting a slice of the world's AI capacity. And then we're letting the massively distributed human ingenuity and creativity and economic engine do its thing. I mean, that's like a crazy idea. Maybe it's a bad one, but that's the kind of thing that I think sounds like someone should think about it more. Sam.", "segments": [{"speaker": "A", "start": 0.4, "end": 53.62, "text": "Say we're able to get to that space, right? Like the move, like the movement that happens with AI and with just technology, which will advance quicker, I think, which is one thing that AI feels like to me it's a fast forward button on technology and on possibility. Because things can be, information can be quantified so quick and a lot of like more menial tasks, even though they're not really menial in people's lives, but menial hypothetically can be done quicker to get a lot of the framework for things done fast. But how will people survive? Like how do we adjust our structure of finance of like if some people own the companies that have the AI and then a lot of people are just using the AIs and the agents created by AIs to do things for them, how will society, like societal members still be able to financially survive? Will there still be money? What is that? Does that make any sense?"}, {"speaker": "B", "start": 53.62, "end": 125.34, "text": "That question totally makes sense. Okay, sorry, I don't know, neither does anybody else. But I'll tell you my current best guess. Okay, well, I'll say two guesses. One, I think it is possible that we put, you know, GPT 7 or whatever in everybody's chatgpt. Everybody gets it for free and everybody has access to just this like crazy thing such that everybody can be more productive, make way more money. It doesn't actually matter that you don't like own the cluster itself, but everybody gets to use it. And it turns out even getting to use it is enough that people are like getting richer, faster and more distributed than ever before that could happen. I think that really is possible. There's another version of this where the most important things that are happening are these systems are discovering new cures for diseases, new kinds of energy, new ways to make spaceships, whatever, and most of that value is accruing to the cluster owners, us. Just so that I'm not dodging the question here. And then I think society will very quickly say, okay, we gotta have some new, some new economic model where we share that and distribute that to people. I used to be really excited about things like ubi. I still am kind of excited. Like Universal Basic Income where you just give everybody money."}, {"speaker": "A", "start": 125.34, "end": 129.939, "text": "Yeah, you hear that term a lot. Yeah, Universal basic Income income. Yeah, I heard you and Rogan talk about that too back."}, {"speaker": "B", "start": 129.94, "end": 202.36, "text": "I still am kind of excited about that. But I think people really need agency. Like they really need to feel like they have a voice in governing the future and deciding where things go. And I think if you just like say, okay, AI is going to do everything and then everybody gets like a dividend from that. It's not going to feel good. And I don't think it actually would be good for people. So I think we need to find a way where we're not just like if we're in this world where we're not just distributing money or wealth. I don't just want a check every month. What I would want is ownership share in whatever the AI creates so that I feel like I'm participating in this thing that's going to compound and get more valuable over time. So I sort of like universal basic wealth better than universal basic income. And I think I don't like basic either. I want like universal extreme wealth for everybody. But even then I think what people really want is the agency to kind of co create the future together. And in a world where it's like the AI is mostly coming up with the new scientific inventions and at least we've got to still have humans like invent the new culture and have that be a very distributed thing."}, {"speaker": "A", "start": 203.88, "end": 214.36, "text": "Okay, I guess, yeah, I see what you're saying. But would that be like an American thing, do you think, like since they were invented here, or do you think. I'm just wondering, what does that look like?"}, {"speaker": "B", "start": 214.36, "end": 217.32, "text": "You know, the economic model of it all or the whole thing? Yeah."}, {"speaker": "A", "start": 217.32, "end": 224.45, "text": "Or like is there a dividend of the company that sin is divided up between the masses? Sort of."}, {"speaker": "B", "start": 224.45, "end": 309.99, "text": "I mean, a crazy idea, but in the spirit of crazy ideas, is that if the world, there's like 8, roughly 8 billion people in the world. If the world can generate like 8 quintillion tokens per year, if that's the world. Actually, let's say the world can generate 20 trillion quint. 20 quintillion tokens per year. Tokens of like each word generated by an AI. Okay, just making up a huge number here. Okay, will say, okay, 12 of those go to the normal capitalistic system, but eight of those eight quintillion tokens are going to get divided up equally among 8 billion people. So everybody gets 1 trillion tokens. And that's your kind of universal basic wealth globally. And people can sell those tokens. Like if I don't need mine, I can sell them to you. We could pool ours together for some new art project we want to do. But instead of just getting a token check, everybody on Earth is getting a slice of the world's AI capacity. And then we're letting the massively distributed human ingenuity and creativity and economic engine do its thing. I mean, that's like a crazy idea. Maybe it's a bad one, but that's the kind of thing that I think sounds like someone should think about it more. Sam."}]}